Tekla Open API Reference for Tekla Structures 2025
StringList.Insert Method
 Inserts the string to the specified index.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public void Insert(
	int index,
	string value
)
Public Sub Insert (
	index As Integer,
	value As String
)
Parameters
index
Type: System.Int32
The index where the string is inserted.
value
Type: System.String
The string to be inserted.
See Also
Reference
StringList Class
Tekla.Structures.Drawing Namespace